##Άσκηση 8 γραμμένη σε Python 3.
import random
lista=[]
##Δημιουργία λίστας με 30 τυχαίους αριθμούς.
for n in range (30):
    lista.append(random.randint(-30,30))
print (lista)
##Αρχικοοίηση των μεταβλητών.
k=0
i=0
j=1
l=2
##Το m είναι 29(γιατι στο range εκλαμβάνεται ως 28) γιατί οι πρώτες δύο θέσεις της λίστας εχούν καληφθεί από
##το i και από το i+1.
m=29
##Το πρώτο στοιχείο της τρίαδας που ελέγχεται καθορίζεται από το i και οι διαδικασία επαναμβάνεται 28 φορές.
for i in range(0,29):
##κάθε φορά το δεύτερο στοιχείο ξεκινάει μια θέση μετά από το πρώτο και εξετάζει για το τρίτο στοιχείο m φορές. 
    for j in range((i+1), m):
##Το τρίτο στοιχείο που συγκρίνεται ξεκινάει μια θέση μετά το δεύτερο και σύνεχιζει m ώστε να φτάσει την τελευταία θέση της λίστας (29) 
        for l in range((j+1),30):
##Εάν το άθροισμα των τρίων στοιχείων είναι 0 τότε ο μετρήτης αυξάνεται κατά 1.
            if (lista[i]+lista[j]+lista[l]==0):
                print (lista[i],lista[j],lista[l])
                k=1
##Το m μειώνεται κάθε φορά που εκτελέιται το i έτσι ώστε οι αναζητήσεις  του τρίτου στοιχείου να μειώνονται κατα ένα .
m-=1
##Εάν ο μετρητής παραμείνει 0 τότε η πάνω συνθήκη δεν πραγματοποιήθηκε επομένως δεν υπάρχει τριάδα αριθμών που να μηδενίζεται.
if k==0:
    print("ΔΕΝ ΒΡΕΘΗΚΑΝ ΖΕΥΓΗ")
    

